In [2]:
import pandas as pd
df = pd.read_csv("Dataset_11.csv")

In [3]:
df["year"].unique()  # 데이터 고유값들이 어떤 종류가 있는지 알고 싶을 때 사용

array([2015, 2016, 2017], dtype=int64)

In [14]:
cnt_country= df["Country"].value_counts()
print(sum(cnt_country!=3))
cnt_country = cnt_country[cnt_country == 3]
cnt_country.head()

20

Lithuania               3
Ethiopia                3
Venezuela               3
United Arab Emirates    3
Georgia                 3
Name: Country, dtype: int64

In [18]:
df_2 = df.loc[df["Country"].isin(cnt_country.index),].reset_index(drop=True)
# isin : list 에 존재하는 요소가 DataSeriest 에 존재하는지 true or false 로 반환
print(len(df_2))
df_2.head(2)

438

       Country  Happiness_Rank  Happiness_Score  year
0  Switzerland               1            7.587  2015
1      Iceland               2            7.561  2015

In [25]:
df_pivot = df.pivot(index=["Country"],
                     columns = ["year"],
                     values = ["Happiness_Score"]).reset_index()
# reset_index : 행번호 인덱스를 사용한다. 
# pivot : 데이터 재구조화
df_pivot.head(2)

          Country Happiness_Score
year                         2015   2016   2017
0     Afghanistan           3.575  3.360  3.794
1         Albania           4.959  4.655  4.644

In [26]:
df_pivot.isna().sum()

                 year
Country                   0
Happiness_Score  2015     8
                 2016     9
                 2017    11
dtype: int64

In [32]:
df_pivot.loc[df_pivot. iloc[:,1].isna(), ]

                       Country Happiness_Score
year                                      2015   2016   2017
13                      Belize             NaN  5.956  5.956
58      Hong Kong S.A.R. China             NaN    NaN  5.472
100                    Namibia             NaN  4.574  4.574
118                Puerto Rico             NaN  7.039    NaN
130                    Somalia             NaN  5.440  5.151
131          Somaliland Region             NaN  5.057    NaN
135                South Sudan             NaN  3.832  3.591
145   Taiwan Province of China             NaN    NaN  6.422

In [44]:
df_pivot.iloc[:,1].isna().reset_index()

    index Happiness_Score
                     2015
0       0           False
1       1           False
2       2           False
3       3           False
4       4           False
..    ...             ...
161   161           False
162   162           False
163   163           False
164   164           False
165   165           False

[166 rows x 2 columns]

In [33]:
df_2.head(2)

       Country  Happiness_Rank  Happiness_Score  year
0  Switzerland               1            7.587  2015
1      Iceland               2            7.561  2015

In [35]:
df_2_pivot = df_2.pivot(index=["Country"], columns=["year"],
                        values = ["Happiness_Score"]).reset_index()
df_2_pivot.head(2)

          Country Happiness_Score
year                         2015   2016   2017
0     Afghanistan           3.575  3.360  3.794
1         Albania           4.959  4.655  4.644

In [38]:
df_2_pivot["score_delta"]=(df_2_pivot.iloc[:,3] - df_2_pivot.iloc[:,1])/2
df_2_pivot.head(2)

          Country Happiness_Score               score_delta
year                         2015   2016   2017
0     Afghanistan           3.575  3.360  3.794      0.1095
1         Albania           4.959  4.655  4.644     -0.1575

In [41]:
df_2_pivot.sort_values("score_delta", ascending = False).head(3)["Country"]

71      Latvia
108    Romania
129       Togo
Name: Country, dtype: object

//-----------------------------------------------------------------

In [46]:
from statsmodels.formula.api import ols
from statsmodels.stats.anova import anova_lm

In [47]:
df_2.head(2)

       Country  Happiness_Rank  Happiness_Score  year
0  Switzerland               1            7.587  2015
1      Iceland               2            7.561  2015

In [49]:
model = ols("Happiness_Score ~ year", data = df_2).fit()
model_report = anova_lm(model)
model_report

             df      sum_sq   mean_sq         F   PR(>F)
year        1.0    0.000071  0.000071  0.000054  0.99412
Residual  436.0  569.483434  1.306155       NaN      NaN

In [50]:
model = ols("Happiness_Score ~ C(year)", data = df_2).fit()
model_report = anova_lm(model)
model_report

             df      sum_sq   mean_sq         F    PR(>F)
C(year)     2.0    0.011198  0.005599  0.004277  0.995732
Residual  435.0  569.472307  1.309132       NaN       NaN

In [53]:
round((model_report["F"][0], 4),3)

TypeError: type tuple doesn't define __round__ method